In [1]:
import numpy as np
import pandas as pd 
from matplotlib import pyplot as pyplot
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split , cross_val_score

In [2]:
df=pd.read_csv("train.csv")[['Age','Pclass','SibSp','Parch','Survived']]

In [3]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [5]:
df.dropna(inplace=True)

In [6]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [7]:
X = df.drop(columns='Survived')
y = df['Survived']

In [12]:
print(np.mean(cross_val_score(LogisticRegression() , X , y ,  scoring='accuracy', cv=10)))

0.6921165884194054

$ Feature \ Construction$

In [ ]:
X['family_count']= X['SibSp']+X['Parch']+1

In [17]:
X.head()

    Age  Pclass  SibSp  Parch  family_count
0  22.0       3      1      0             2
1  38.0       1      1      0             2
2  26.0       3      0      0             1
3  35.0       1      1      0             2
4  35.0       3      0      0             1

In [19]:
def count(num):
    if num==1:
        return 0
    elif num>1 & num<=4:
        return 1
    else:
        return 2

In [20]:
count(4)

1

In [21]:
X['family_size'] = X['family_count'].apply(count)

In [22]:
X.head()

    Age  Pclass  SibSp  Parch  family_count  family_size
0  22.0       3      1      0             2            1
1  38.0       1      1      0             2            1
2  26.0       3      0      0             1            0
3  35.0       1      1      0             2            1
4  35.0       3      0      0             1            0

In [24]:
X.drop(columns=['SibSp' , 'Parch' , 'family_count'] , inplace=True)

In [25]:
X.head()

    Age  Pclass  family_size
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1
4  35.0       3            0

In [27]:
np.mean(cross_val_score(LogisticRegression() , X ,y , scoring='accuracy' , cv=10))

np.float64(0.7187793427230047)

$Feature \ Splitting $

In [29]:
df = pd.read_csv("train.csv")

In [30]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df['Name']   # split Mr / Mrs to know M or F

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [34]:
df['title'] = df['Name'].str.split(', ' , expand=True)[1].str.split('.' , expand=True)[0]

In [36]:
df['title']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: title, Length: 891, dtype: object

In [38]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['title'] == 'Mrs'] = 1

C:\Users\Jayhind\AppData\Local\Temp\ipykernel_6236\3353138612.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Is_Married'].loc[df['title'] == 'Mrs'] = 1
C:\Users\Jayhind\AppData\Local\Temp\ipykernel_6236\3353138612.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['title'] == 'Mrs'] = 1

In [ ]:
df['Is_Married']   # New Feature

0      0
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64